0-misc/of/hw01/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
	(0.25 0 0)
	(0.75 0 0)
	(1 0 0)
	
	(0 0.25 0)
	(0.25 0.25 0)
	(0.75 0.25 0)
	(1 0.25 0)
	
	(0 0.75 0)
	(0.25 0.75 0)
	(0.75 0.75 0)
	(1 0.75 0)
	
	(0 1 0)
	(0.25 1 0)
	(0.75 1 0)
	(1 1 0)
	
	(0 0 0.1)
	(0.25 0 0.1)
	(0.75 0 0.1)
	(1 0 0.1)
	
	(0 0.25 0.1)
	(0.25 0.25 0.1)
	(0.75 0.25 0.1)
	(1 0.25 0.1)
	
	(0 0.75 0.1)
	(0.25 0.75 0.1)
	(0.75 0.75 0.1)
	(1 0.75 0.1)
	
	(0 1 0.1)
	(0.25 1 0.1)
	(0.75 1 0.1)
	(1 1 0.1)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (5 5 1) simpleGrading (1 1 1)
	hex (1 2 6 5 17 18 22 21) (10 5 1) simpleGrading (1 1 1)
	hex (2 3 7 6 18 19 23 22) (5 5 1) simpleGrading (1 1 1)
	hex (4 5 9 8 20 21 25 24) (5 10 1) simpleGrading (1 1 1)
	hex (6 7 11 10 22 23 27 26) (5 10 1) simpleGrading (1 1 1)
	hex (8 9 13 12 24 25 29 28) (5 5 1) simpleGrading (1 1 1)
	hex (9 10 14 13 25 26 30 29) (10 5 1) simpleGrading (1 1 1)
	hex (10 11 15 14 26 27 31 30) (5 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (12 28 29 13)
			(13 29 30 14)
			(14 30 31 15)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 16 20 4)
			(4 20 24 8)
			(8 24 28 12)
			(3 7 23 19)
			(7 11 27 23)
			(11 15 31 27)
			(0 1 17 16)
			(1 2 18 17)
			(2 3 19 18)
			(5 21 22 6)
			(5 9 25 21)
			(6 22 26 10)
			(9 10 26 25)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
			(1 5 6 2)
			(2 6 7 3)
			(4 8 9 5)
			(6 10 11 7)
			(8 12 13 9)
			(9 13 14 10)
			(10 14 15 11)
			(16 17 21 20)
			(17 18 22 21)
			(18 19 23 22)
			(20 21 25 24)
			(22 23 27 26)
			(24 25 29 28)
			(25 26 30 29)
			(26 27 31 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
